IdeaRS.OpenModel.Concrete.ConcreteMemberType
Member type

IdeaRS.OpenModel.Concrete.ConcreteMemberType.NoDefined
Not defined

IdeaRS.OpenModel.Concrete.ConcreteMemberType.Beam
Beam

IdeaRS.OpenModel.Concrete.ConcreteMemberType.Column
Column

IdeaRS.OpenModel.Concrete.ConcreteMemberType.BeamSlab
Beam slab

IdeaRS.OpenModel.Concrete.ConcreteMemberType.HollowCoreSlab
Hollw core slab

IdeaRS.OpenModel.Concrete.ConcreteMemberType.TwoWaySlab
2-way slab

IdeaRS.OpenModel.Concrete.ConcreteMemberType.Plate
Plate

IdeaRS.OpenModel.Concrete.ConcreteMemberType.Wall
Wall